#include <iostream>

/**
 * Решение всех задач данного раздела предполагает использование кучи.
 *
 * 2_1. Жадина.
 * Вовочка ест фрукты из бабушкиной корзины. В корзине лежат фрукты разной массы. Вовочка
 * может поднять не более K грамм. Каждый фрукт весит не более K грамм. За раз он выбирает
 * несколько самых тяжелых фруктов, которые может поднять одновременно, откусывает от каждого
 * половину и кладет огрызки обратно в корзину. Если фрукт весит нечетное число грамм, он
 * откусывает большую половину. Фрукт массы 1гр он съедает полностью.
 * Определить за сколько подходов Вовочка съест все фрукты в корзине.
 *
 * Формат входных данных. Вначале вводится n - количество фруктов и n строк с массами фруктов.
 * Затем K - "грузоподъемность".
 *
 * Формат выходных данных. Неотрицательное число - количество подходов к корзине.
 *
 * Пример 1:
 * 3
 * 1 2 2
 * 2
 * Вывод:
 * 4
 *
 * Пример 2:
 * 3
 * 4 3 5
 * 6
 * Вывод:
 * 5
 *
 * Пример 3:
 * 7
 * 1 1 1 1 1 1 1
 * 3
 * Вывод:
 * 3
 */
int main() {
    std::cout << "Hello, World!" << std::endl;
    return 0;
}

